config.org
* JUPYTER NOTEBOOK (IPYNB)
Setting up a way to edit jupyter notebook files in emacs. However, you should probably use VSCode or Colab for Jupyter since Emacs isn't great with it.

#+begin_src emacs-lisp
(use-package jupyter
  :ensure t
  :config
  (require 'jupyter))

;;Setting up a few keybindings to use in jupyter notebook (ein) [NOTE: these keybindings only work when in ein mode]
(with-eval-after-load 'evil
  (evil-define-key '(normal insert visual) ein:notebook-mode-map (kbd "M-t") 'ein:worksheet-change-cell-type) ;toggles type of block (code<->mkdn)
  (evil-define-key '(normal insert visual) ein:notebook-mode-map (kbd "M-b") 'ein:worksheet-insert-cell-below)
  (evil-define-key '(normal insert visual) ein:notebook-mode-map (kbd "M-a") 'ein:worksheet-insert-cell-above)
  (evil-define-key '(normal)  ein:notebook-mode-map (kbd "dd") 'ein:worksheet-kill-cell)
  (evil-define-key '(normal insert visual) ein:notebook-mode-map (kbd "M-s") 'ein:notebook-save-notebook-command-km)
  (evil-define-key '(normal insert visual) ein:notebook-mode-map (kbd "M-r") 'ein:worksheet-execute-cell)
  (evil-define-key '(normal insert visual) ein:notebook-mode-map (kbd "M-e") 'ein:worksheet-execute-all-cells)
)

;;Toggling line numbers to be always on while using notebook (.ipynb file)——for some reason they keep turning off
(defun my-ein-setup ()
  "My setup for ein:notebook-mode."
  (display-line-numbers-mode 1))
(add-hook 'ein:notebook-mode-hook 'my-ein-setup)
(setq ein:worksheet-enable-undo t)

#+end_src


#+end_src

* GRAPHICAL USER INTERFACE TWEAKS
Let's make GNU Emacs look a little better.

** Disable Toolbars, Scrollbars, & Mode line modes
#+begin_src emacs-lisp
;;disabling tool & scroll bars
(tool-bar-mode -1)
(scroll-bar-mode -1)

;;setting mode line to only show major mode
(setq-default mode-line-modes
              (list (propertize "%m" 'face 'mode-line-mode)))

#+end_src

** Display Line Numbers and Truncated Lines
#+begin_src emacs-lisp
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
#+end_src

** Relative Line Numbering
#+begin_src emacs-lisp
  (setq display-line-numbers-type 'relative)
#+end_src

** Yank Pulse
For momentarily pulsing yanked text
#+begin_src emacs-lisp
  (defun alrayyes/evil-yank-advice (orig-fn beg end &rest args)
    (pulse-momentary-highlight-region beg end)
    (apply orig-fn beg end args))

  (advice-add 'evil-yank :around 'alrayyes/evil-yank-advice)
#+end_src

* IVY (COUNSEL)
+ Ivy, a generic completion mechanism for Emacs.
+ Counsel, a collection of Ivy-enhanced versions of common Emacs commands.
+ Ivy-rich allows us to add descriptions alongside the commands in M-x.

#+begin_src emacs-lisp
(use-package counsel
  :after ivy
  :config (counsel-mode))

(use-package ivy
  :bind
  ;; ivy-resume resumes the last Ivy-based completion.
  (("C-c C-r" . ivy-resume)
   ("C-x B" . ivy-switch-buffer-other-window))
  :custom
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
  (setq enable-recursive-minibuffers t)
  :config
  (ivy-mode))

(use-package all-the-icons-ivy-rich
  :ensure t
  :init (all-the-icons-ivy-rich-mode 1))

(use-package ivy-rich
  :after ivy
  :ensure t
  :init (ivy-rich-mode 1) ;; this gets us descriptions in M-x.
  :custom
  (ivy-virtual-abbreviate 'full
   ivy-rich-switch-buffer-align-virtual-buffer t
   ivy-rich-path-style 'abbrev)
  :config
  (ivy-set-display-transformer 'ivy-switch-buffer
                               'ivy-rich-switch-buffer-transformer))
#+end_src

* LANGUAGE SUPPORT
Emacs has built-in programming language modes for Lisp, Scheme, DSSSL, Ada, ASM, AWK, C, C++, Fortran, Icon, IDL (CORBA), IDLWAVE, Java, Javascript, M4, Makefiles, Metafont, Modula2, Object Pascal, Objective-C, Octave, Pascal, Perl, Pike, PostScript, Prolog, Python, Ruby, Simula, SQL, Tcl, Verilog, and VHDL.  Other languages will require you to install additional modes.

#+begin_src emacs-lisp
(use-package haskell-mode)
(use-package lua-mode)

#+end_src

* MAGIT
Setting up magit (git package in emacs). Seems to be working fine with evil mode now (check keybindings such as s, c, etc while in magit status + global magit keybindings set up with SPC). NOTE: need to use evil-collection for evil mode with magit buffer.

#+begin_src emacs-lisp
(use-package magit
  :ensure t)

;;need to use evil-collection for evil mode to work properly with magit status buffer (installed in another section)
#+end_src


# * NEOTREE 
# Setting up neotree for a project/file manager as a sidebar. 

# #+BEGIN_SRC emacs-lisp
# (use-package neotree			
#   :config
#   (setq neo-smart-open nil
#         neo-show-hidden-files t
#         neo-window-width 35
#         neo-window-fixed-size nil
#         inhibit-compacting-font-caches t
#         projectile-switch-project-action 'neotree-projectile-action) 
#         ;; truncate long file names in neotree
#         (add-hook 'neo-after-create-hook
#            #'(lambda (_)
#                (with-current-buffer (get-buffer neo-buffer-name)
#                  (setq truncate-lines t)
#                  (setq word-wrap nil)
#                  (make-local-variable 'auto-hscroll-mode)
#                  (setq auto-hscroll-mode nil)))) (add-hook 'neotree-mode-hook
#               (lambda ()
#                 (define-key evil-normal-state-local-map (kbd "TAB") 'neotree-enter)
#                 (define-key evil-normal-state-local-map (kbd "SPC") 'neotree-quick-look)
#                 (define-key evil-normal-state-local-map (kbd "q") 'neotree-hide)
#                 (define-key evil-normal-state-local-map (kbd "RET") 'neotree-enter)
#                 (define-key evil-normal-state-local-map (kbd "g") 'neotree-refresh)
#                 (define-key evil-normal-state-local-map (kbd "n") 'neotree-next-line)
#                 (define-key evil-normal-state-local-map (kbd "p") 'neotree-previous-line)
#                 (define-key evil-normal-state-local-map (kbd "A") 'neotree-stretch-toggle)
#                 (define-key evil-normal-state-local-map (kbd "H") 'neotree-hidden-file-toggle)))

#          (add-hook 'neotree-mode-hook
#               (lambda ()
#                 (define-key evil-normal-state-local-map (kbd "TAB") 'neotree-enter)
#                 (define-key evil-normal-state-local-map (kbd "SPC") 'neotree-quick-look)
#                 (define-key evil-normal-state-local-map (kbd "q") 'neotree-hide)
#                 (define-key evil-normal-state-local-map (kbd "RET") 'neotree-enter)
#                 (define-key evil-normal-state-local-map (kbd "g") 'neotree-refresh)
#                 (define-key evil-normal-state-local-map (kbd "n") 'neotree-next-line)
#                 (define-key evil-normal-state-local-map (kbd "p") 'neotree-previous-line)
#                 (define-key evil-normal-state-local-map (kbd "A") 'neotree-stretch-toggle)
#                 (define-key evil-normal-state-local-map (kbd "H") 'neotree-hidden-file-toggle)))
# )

# #+end_src

* MARKDOWN MODE
Setting up markdown mode for viewing and editing markdown (md) files. 
#+begin_src emacs-lisp
(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown"))
#+end_src

* ORG MODE
** Enabling Table of Contents
#+begin_src emacs-lisp
  (use-package toc-org
      :commands toc-org-enable
      :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Enabling Org Bullets
Org-bullets gives us attractive bullets rather than asterisks.

#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (use-package org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

** Disable Electric Indent
Org mode source blocks have some really weird and annoying default indentation behavior.  I think this has to do with electric-indent-mode, which is turned on by default in Emacs.  So let's turn it OFF!

#+begin_src emacs-lisp
(electric-indent-mode -1)
(setq org-edit-src-content-indentation 0)
#+end_src

** Source Code Block Tag Expansion
Org-tempo is not a separate package but a module within org that can be enabled.  Org-tempo allows for '<s' followed by TAB to expand to a begin_src tag.  Other expansions available include:

| Typing the below + TAB | Expands to ...                          |
|------------------------+-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |


#+begin_src emacs-lisp 
(require 'org-tempo)
#+end_src
** Hide Highlight Syntax
#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t)
#+end_src

** Org Babel Languages
Enabling Babel for multiple languages. This allows you to execute code blocks of these languages within org mode.

#+begin_src emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
    (python . t)
    (C . t) ;includes C++
    (R .t)
    (latex . t)
    (js . t)
    (css . t)
    (matlab . t)
    (java . t)
    (sql . t)
    (shell . t)
 ))

;;made it so that you don't have to input "python3" manually everytime you want a python code block
(add-to-list 'org-babel-default-header-args:python
             '(:python . "python3"))

;;made it so that exporting includes both code block + result
(setq org-babel-default-header-args
      (cons '(:exports . "both")
            (assq-delete-all :exports org-babel-default-header-args)))

#+end_src

** Code Blocks
Defines some keybindings related to code blocks in org mode.
#+begin_src emacs-lisp
(global-set-key (kbd "M-p")  'org-edit-special)
(global-set-key (kbd "M-;")  'org-edit-src-exit)
(global-set-key (kbd "M-r")  'org-ctrl-c-ctrl-c)
#+end_src

** Latex
Enabling automatic latex preview in Org Mode (Automatically toggle Org mode LaTeX fragment previews as the cursor enters and exits them)——think bold/italicizing in org mode.
#+begin_src emacs-lisp

;;installing package to display latex in-line immediately after typing it
(use-package org-fragtog)

(add-hook 'org-mode-hook 'org-fragtog-mode)

;;tweaking some settings to fix exporting org docs
(setq-default org-export-with-broken-links t)
(setq-default org-export-with-toc t)
(setq-default org-confirm-babel-evaluate nil)

#+end_src

** Notes
Setting up location to save notes taken using org-capture.

#+begin_src emacs-lisp
(setq org-default-notes-file "/Users/yazanalrayyes/Desktop/Work/Notes.org")
#+end_src

* PROJECTILE
[[https://github.com/bbatsov/projectile][Projectile]] is a project interaction library for Emacs. It should be noted that many projectile commands do not work if you have set "fish" as the "shell-file-name" for Emacs. 

#+begin_src emacs-lisp
(use-package projectile
  :ensure t
  :config
  (projectile-mode 1))

#+end_src

