config.org
* QUICK NAVIGATION (SCAN THROUGH DOCUMENT)
Creating a shorter for moving x amount of lines up & down for a faster way to scan through buffer.

#+begin_src emacs-lisp
;Defining scan line size
(defcustom num-lines 30 "Number of lines to use for custom quick navigation scanning"
  :type 'integer
  :group 'my-custom-group)

;Defining function
(defun scan-up()
  (interactive)
  (previous-line num-lines))
(defun scan-down()
  (interactive)
  (next-line num-lines))

;Adding keybindings
(global-set-key (kbd "M-k") 'scan-up)
(global-set-key (kbd "M-j") 'scan-down)
#+end_src

* RAINBOW MODE
Display the actual color as a background for any hex color value (ex. #ffffff, #928345).  The code block below enables rainbow-mode in all programming modes (prog-mode) as well as org-mode, which is why rainbow works in this document.  

#+begin_src emacs-lisp
(use-package rainbow-mode
  :hook org-mode prog-mode
  :diminish)
#+end_src

* SHELLS AND TERMINALS
In my configs, all of my shells (bash, fish, zsh and the ESHELL) require my shell-color-scripts-git package to be installed.  On Arch Linux, you can install it from the AUR.  Otherwise, go to my shell-color-scripts repository on GitLab to get it.

** Eshell
Eshell is an Emacs 'shell' that is written in Elisp.

#+begin_src emacs-lisp
(use-package eshell-syntax-highlighting
  :after esh-mode
  :config
  (eshell-syntax-highlighting-global-mode +1))

;; eshell-syntax-highlighting -- adds fish/zsh-like syntax highlighting.
;; eshell-rc-script -- your profile for eshell; like a bashrc for eshell.
;; eshell-aliases-file -- sets an aliases file for the eshell.
  
(setq eshell-rc-script (concat user-emacs-directory "eshell/profile")
      eshell-aliases-file (concat user-emacs-directory "eshell/aliases")
      eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      eshell-destroy-buffer-when-process-dies t
      eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))
#+end_src
# ** Vterm
# Vterm is a terminal emulator within Emacs.  The 'shell-file-name' setting sets the shell to be used in M-x shell, M-x term, M-x ansi-term and M-x vterm.  By default, the shell is set to 'fish' but could change it to 'bash' or 'zsh' if you prefer.

# #+begin_src emacs-lisp
#   (add-to-list 'load-path "~/sources/emacs-libvterm")
#   (require 'vterm)

#   (use-package vterm
#   :config
#   (setq shell-file-name "/bin/sh"
#         vterm-max-scrollback 5000))
# #+end_src

# ** Vterm-Toggle 
# [[https://github.com/jixiuf/vterm-toggle][vterm-toggle]] toggles between the vterm buffer and whatever buffer you are editing.

# #+begin_src emacs-lisp
# (use-package vterm-toggle
#   :after vterm
#   :config
#   (setq vterm-toggle-fullscreen-p nil)
#   (setq vterm-toggle-scope 'project)
#   (add-to-list 'display-buffer-alist
#                '((lambda (buffer-or-name _)
#                      (let ((buffer (get-buffer buffer-or-name)))
#                        (with-current-buffer buffer
#                          (or (equal major-mode 'vterm-mode)
#                              (string-prefix-p vterm-buffer-name (buffer-name buffer))))))
#                   (display-buffer-reuse-window display-buffer-at-bottom)
#                   ;;(display-buffer-reuse-window display-buffer-in-direction)
#                   ;;display-buffer-in-direction/direction/dedicated is added in emacs27
#                   ;;(direction . bottom)
#                   ;;(dedicated . t) ;dedicated is supported in emacs27
#                   (reusable-frames . visible)
#                   (window-height . 0.3))))
# #+end_src

** Ansi Term Shortcut
Creating a keybinding to allow opening ansi terminal emulator as a split window in the directory of the current buffer.

#+begin_src emacs-lisp
(defun open-ansi-term-in-split ()
  "Open an ANSI term in a split window."
  (interactive)
  (split-window-below)
  (other-window 1)
  (ansi-term "/bin/zsh") ; You can change "/bin/zsh" to another shell if you like
  (let ((win-width (window-width)))
    (if (>= win-width 20)
        (shrink-window 10))))

(global-set-key (kbd "M-e") 'open-ansi-term-in-split)


#+end_src

* SUDO EDIT
[[https://github.com/nflath/sudo-edit][sudo-edit]] gives us the ability to open files with sudo privileges or switch over to editing with sudo privileges if we initially opened the file without such privileges.

#+begin_src emacs-lisp
(use-package sudo-edit
  :config
    (AY/leader-keys
      "fu" '(sudo-edit-find-file :wk "Sudo find file")
      "fU" '(sudo-edit :wk "Sudo edit file")))
#+end_src

* TAB BAR
Enabling tab bar mode, allowing multiple tabs to be open with different buffers & windows. [NOTE: This is different from Tab Line. Tab line is for buffers, not windows]
I'm also using some setting some keybindings to be the same as chrome's so you keep using the same ones for tabs.

#+begin_src emacs-lisp
;;enabling tab bar mode by default
(setq tab-bar-mode t)
(setq tab-bar-history-mode t)

;;keybindbing for closing current tab
(global-set-key (kbd "M-w") 'tab-close)

;;keybinding for opening new tab 
(global-set-key (kbd "M-n") 'tab-new)

;;keybinding for opening recently closed tab
(global-set-key (kbd "M-t") 'tab-undo)

;;keybinding for cycling through tabs (it wraps around if it reaches end)
(global-set-key (kbd "M-/") 'tab-bar-switch-to-next-tab)

#+end_src

* THEME
Currently using srcery theme. timu-macos is a theme I found on https://emacsthemes.com/, but it seems to mess up emacs graphics.
#+begin_src emacs-lisp

;maximize window on startup
(add-to-list 'initial-frame-alist '(fullscreen . fullscreen))


      ;THEME 1 (SRCERY)
              ;; (use-package srcery-theme
              ;; :ensure t
              ;; :config
              ;; (load-theme 'srcery t))

      ;THEME 2 (VSCODE DARK)

      ;; (use-package vscode-dark-plus-theme
      ;;   :ensure t
      ;;   :config
      ;;   (load-theme 'vscode-dark-plus t))

    ;;THEME 3 (doom themes)
    ;;A bunch of themes from: https://github.com/doomemacs/themes
    ;;some good ones: doom-fairy-floss, doom-dracula 
    ;; (use-package doom-themes
    ;;   :ensure t
    ;;   :config
    ;;   ;; Global settings (defaults)
    ;;   (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
    ;;         doom-themes-enable-italic t) ; if nil, italics is universally disabled
    ;;   (load-theme 'doom-dracula	 t)

    ;;   ;; Enable flashing mode-line on errors
    ;; ;;  (doom-themes-visual-bell-config)
    ;;   ;; Enable custom neotree theme (all-the-icons must be installed!)
    ;; ;;  (doom-themes-neotree-config)
    ;;   ;; Corrects (and improves) org-mode's native fontification.
    ;;   (doom-themes-org-config))

;THEME 4 (Dracula theme)
;;installing melpa
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(package-initialize)

(add-to-list 'custom-theme-load-path "~/.emacs.d/themes")
(load-theme 'dracula t)

;;below code makes emacs window tranlucent (only works while window is not fullscreen)

;(set-frame-parameter (selected-frame) 'alpha '(85 . 50)) ;for current frame
;(add-to-list 'default-frame-alist '(alpha . (85 . 50))) ;for all frames (default value)

#+end_src

